data-structs-algorithms/products_of_array_except_self.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-10 Wed 13:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Products_of_array_except_self</title>
<meta name="author" content="Nyll" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Products<sub>of</sub><sub>array</sub><sub>except</sub><sub>self</sub></h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge30bb42">1. Problem</a>
<ul>
<li><a href="#org3cd19cd">1.1. Example:</a></li>
<li><a href="#orgf088c11">1.2. demonstration:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Explaination Source:
<a href="https://www.youtube.com/watch?v=bNvIQI2wAjk">https://www.youtube.com/watch?v=bNvIQI2wAjk</a>
</p>

<p>
Python script:
<a href="products_of_array_except_self.py">products_of_array_except_self.py</a>
</p>

<div id="outline-container-orge30bb42" class="outline-2">
<h2 id="orge30bb42"><span class="section-number-2">1.</span> Problem</h2>
<div class="outline-text-2" id="text-1">
<p>
Given an integer array nums, return an array answer such that answer[i] is equal to the product of all the elements of nums except nums[i].
</p>

<ul class="org-ul">
<li>The product of any prefix or suffix of nums is guaranteed to fit in a 32-bit integer.</li>

<li>You must write an algorithm that runs in O(n) time and without using the division operation.</li>
</ul>
</div>

<div id="outline-container-org3cd19cd" class="outline-3">
<h3 id="org3cd19cd"><span class="section-number-3">1.1.</span> Example:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Input: nums = [1,2,3,4]
Output: [24,12,8,6]
</p>
</div>
</div>

<div id="outline-container-orgf088c11" class="outline-3">
<h3 id="orgf088c11"><span class="section-number-3">1.2.</span> demonstration:</h3>
<div class="outline-text-3" id="text-1-2">
<p>
[
<del>1</del> * 2 * 3 * 4 = 24,
1 * <del>2</del> * 3 * 4 = 12,
1 * 2 * <del>3</del> * 4 = 8,
1 * 2 * 3 * <del>4</del> = 6
]
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nyll</p>
<p class="date">Created: 2022-08-10 Wed 13:05</p>
</div>
</body>
</html>
